OdRxObjectPtr.#ctor
\details
Constructors for the non-typified smart pointer.
\param pSource [in]  Pointer to the specified object to be assigned for the new SmartPointer object.
\remarks
If pSourceis specified, the smart pointer is set to the address of the specified object. If pSource is not specified, the smart pointer is set to a NULL.
\remarks
If OdRxObjMod is specified, the reference counter of the specified object
is *not* incremented.